🚀&nbsp; env0 had composed a PR Plan for environment [My First Project / Sec-org-k8s-92544](https://app.env0.com/p/acad8837-65ad-4d2b-a57b-634bd260127a/environments/6ad490de-304c-41b2-80e2-0fd48fdbb192):
```
Plan: 2 to add, 2 to change, 1 to destroy.
```

<details>

<summary>Plan Details</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:


  # module.eks.aws_autoscaling_group.workers[0] will be updated in-place
  ~ resource "aws_autoscaling_group" "workers" {
        id                        = "education-eks-AihNc1w2-worker-group-120211101091753843300000007"
      ~ launch_configuration      = "education-eks-AihNc1w2-worker-group-120211101091745229500000005" -> (known after apply)
        name                      = "education-eks-AihNc1w2-worker-group-120211101091753843300000007"
        # (23 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }


  # module.eks.aws_launch_configuration.workers[0] must be replaced
+/- resource "aws_launch_configuration" "workers" {
      ~ arn                              = "arn:aws:autoscaling:us-east-2:704479110758:launchConfiguration:1a00811b-7e22-4234-8fc8-bc5fbf665aad:launchConfigurationName/education-eks-AihNc1w2-worker-group-120211101091745229500000005" -> (known after apply)
      ~ ebs_optimized                    = false -> true # forces replacement
      ~ id                               = "education-eks-AihNc1w2-worker-group-120211101091745229500000005" -> (known after apply)
      ~ instance_type                    = "t2.small" -> "m5.2xlarge" # forces replacement
      + key_name                         = (known after apply)
      ~ name                             = "education-eks-AihNc1w2-worker-group-120211101091745229500000005" -> (known after apply)
      - vpc_classic_link_security_groups = [] -> null
        # (7 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ metadata_options {
          ~ http_put_response_hop_limit = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ root_block_device {
          ~ throughput            = 0 -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }


  # module.eks.kubernetes_config_map.aws_auth[0] will be updated in-place
  ~ resource "kubernetes_config_map" "aws_auth" {
      ~ data        = {
          ~ "mapUsers"    = <<-EOT
              - - userarn: "arn:aws:iam::704479110758:user/david"
              -   username: "davidn"
              -   groups:
              -     - "system:masters"
              + []
            EOT
            # (2 unchanged elements hidden)
        }
        id          = "kube-system/aws-auth"
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + content              = <<-EOT
            apiVersion: v1
            preferences: {}
            kind: Config
            
            clusters:
            - cluster:
                server: https://D0A1A2C6D851C7E12F726700178EEA7B.gr7.us-east-2.eks.amazonaws.com
                certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeE1URXdNVEE0TlRBd05sb1hEVE14TVRBek1EQTROVEF3Tmxvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTFd0CnQ0VzVpL0dNbitqSE1iWTVHY0JLRUVMZ1VaU3BobUxLMmlJVnlQTXJzcENxVmd5RGVJWGQ3WGxMNDRxYXJ4TXgKUkZnUlBJWHJzT1RIWEJjYUpnMlRBYXYvWVFzRHQyMlRtTWpRU3lRLzNSZUE4ek1TL1UwOXQwNHEyK2ZJejdScgpENmRLdGY1SkQxbGI0S1MxOEpKTTROb1FmcE9TMTl0V0RHY0xWQ3VBSWkwVU5FZnFsQVEyQmhYYk5Td20rbnFzClNHNERmdE0wRGdGQnRZelJadERqWU5UUER6WnhMazVHa3dQdEVqazZWNkdxbFZ0SDJDQlZDZlZHbEVNTmZOVkQKT2tPWjZ4VTlWVXBZaVU4TXYzVGJSUEhEbzk1a0llTzFpYUhjdWQ0bUl5d0RhVEF3d1NiNndaVWtyZ05pL280NQpsbnBrQkJKY1l5L3cwazlya2lVQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZFRUVLNWZndHJMS3hQUXVlTDBXT2JNZWZ1ejBNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFCRlI2cENwc0l2WmR0VTg2Y2tlbHlaeFRUMzBwRFlZL2g3b2VxMjlXMlhCSHpCZVJUZApsRTlWTUd3RCt0UjhuTUFlUkR4NDVTelAxOEFsR0l0RXhsL2hiN1BNREZtOC9XYzJVSnlZZm5kY3lVSDZwbktBClBaLzJmQWZaZ2Vjam9uTExoekNTcEFXQzlUUkVLQmkyaTN1RldMVzFTNzExVWg5SXN6c1p4cjAwYjNNdWxBUi8KcVF4dm56U0JLeVZHUERWZlZqZUZlVU1OeFppcWhKeHZwQnoyWENkbXdscXdxWStjUGJrajQwUTk0ejBJZVp1UwpZNGpTN2h2VFd5VlIwOEFybytnRm1DV3gzeGRySnEraTQ3ZklHSDlYZFBIcUluZ0RxbjRyUThndXlKME5RRUhrClFkWVE4elU2MHJGcEVIL0tFaWlCQUwwK2psZDB6Zm5BTlB1NwotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
              name: eks_education-eks-AihNc1w2
            
            contexts:
            - context:
                cluster: eks_education-eks-AihNc1w2
                user: eks_education-eks-AihNc1w2
              name: eks_education-eks-AihNc1w2
            
            current-context: eks_education-eks-AihNc1w2
            
            users:
            - name: eks_education-eks-AihNc1w2
              user:
                exec:
                  apiVersion: client.authentication.k8s.io/v1alpha1
                  command: aws-iam-authenticator
                  args:
                    - "token"
                    - "-i"
                    - "education-eks-AihNc1w2"
        EOT
      + directory_permission = "0755"
      + file_permission      = "0600"
      + filename             = "./kubeconfig_education-eks-AihNc1w2"
      + id                   = (known after apply)
    }

Plan: 2 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ config_map_aws_auth = [
      ~ {
          ~ binary_data = null -> {}
          ~ metadata    = [
              ~ {
                  ~ annotations      = null -> {}
                  ~ resource_version = "2916" -> "19977"
                    # (6 unchanged elements hidden)
                },
            ]
            # (2 unchanged elements hidden)
        },
    ]
```
</details>

  
[Full Plan Logs on env0](https://app.env0.com/p/acad8837-65ad-4d2b-a57b-634bd260127a/environments/6ad490de-304c-41b2-80e2-0fd48fdbb192/deployments/0f13b237-c565-4657-9595-dabdd838d163)